---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarSystemFailures.HostFlagPathOn
source: html/b3da663b-d64a-2ff9-f99d-46cf5f164d77.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarSystemFailures.HostFlagPathOn Property

## Syntax (C#)
```csharp
public static FailureDefinitionId HostFlagPathOn { get; }
```